app/controllers/articles_controller.rb

    def create
      @article = Article.new(article_params)

      respond_to do |format|
        if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello"], ["body", "Hello, rails."], ["created_at", "2020-01-27 18:29:15.488287"], ["updated_at", "2020-01-27 18:29:15.488287"]]

    def update
      respond_to do |format|
        if @article.update(article_params)
---
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "Hello there, rails. "], ["updated_at", "2020-01-27 18:29:23.250176"], ["id", 1]]